templateS/app/controllers/grupos_controller.rb

  def index
    @grupos = Grupo.all
---
SELECT "grupos".* FROM "grupos"

  def create
    @grupo = Grupo.new(grupo_params)

    respond_to do |format|
      if @grupo.save
---
INSERT INTO "grupos" ("name", "created_at", "updated_at") VALUES ('salvajada', '2025-06-04 18:31:01.614382', '2025-06-04 18:31:01.614382') RETURNING "id"

  def update
    respond_to do |format|
      if @grupo.update(grupo_params)
---
UPDATE "grupos" SET "updated_at" = '2025-06-04 18:31:06.127362' WHERE "grupos"."id" = 1

    def set_grupo
      @grupo = Grupo.find(params.expect(:id))
---
SELECT "grupos".* FROM "grupos" WHERE "grupos"."id" = 1 LIMIT 1